<template>
    <section class="introducing">
        <div class="header">
            <h2> Добро пожаловать на страницу проекта "Рассчитай сам"</h2>
        </div>
        <div class="post-header">
            <h3> Наша цель - уменьшить количество ошибок при подсчете и облегчить процесс вязания! </h3>
        </div>
    </section>
    <section class="body">
        <div class="aboutPrg">
            <h2 class="header_body">О проекте</h2>
            Для людей, увлекающихся вязанием, не секрет, что для полноценного изделия требуется немало материала,
            который часто бывает дорогим. Поэтому, чтобы сэкономить время и деньги существуют онлайн-калькуляторы,
            где рассчитывается нужное количество ниток. Но они зачастую ограничены в персонализации для подсчёта,
            отсутствуют многие популярные категории изделий, нет различий между вязанием крючком и спицами. Вследствие
            этого, мой проект решает проблему отсутствия современных инструментов расчёта для вязания не в промышленном
            масштабе.
        </div>
        <div class="research">
            <h2 class="header_body">О проекте</h2>
            Для людей, увлекающихся вязанием, не секрет, что для полноценного изделия требуется немало материала,
            который часто бывает дорогим. Поэтому, чтобы сэкономить время и деньги существуют онлайн-калькуляторы,
            где рассчитывается нужное количество ниток. Но они зачастую ограничены в персонализации для подсчёта,
            отсутствуют многие популярные категории изделий, нет различий между вязанием крючком и спицами. Вследствие
            этого, мой проект решает проблему отсутствия современных инструментов расчёта для вязания не в промышленном
            масштабе.
        </div>
        <div class="research">
            <h2 class="header_body">О проекте</h2>
            Для людей, увлекающихся вязанием, не секрет, что для полноценного изделия требуется немало материала,
            который часто бывает дорогим. Поэтому, чтобы сэкономить время и деньги существуют онлайн-калькуляторы,
            где рассчитывается нужное количество ниток. Но они зачастую ограничены в персонализации для подсчёта,
            отсутствуют многие популярные категории изделий, нет различий между вязанием крючком и спицами. Вследствие
            этого, мой проект решает проблему отсутствия современных инструментов расчёта для вязания не в промышленном
            масштабе.
        </div>
    </section>
</template>

<script>
export default {
    name: "AboutProjectView"
}
</script>

<style scoped>
.introducing {
    display: flex;
    flex-direction: column;
    justify-content: center;
    align-items: center;
    margin-top: 1rem;
}

.header {
    color: var(--text-color);
    font-size: 1.5rem;
}

.post-header > h3{
    color: #B275FF !important;
    font-size: 1.1rem;
}

.body {
    display: flex;
    flex-direction: row;
    justify-content: space-evenly;
    align-items: center;
    margin-top: 3rem;
}

.header_body {
    margin-bottom: 1rem;
    color: #B275FF;
    text-align: center;
}

.aboutPrg, .research {
    max-width: 23rem;
    text-align: justify;
    border: 3px solid #B275FF;
    border-radius: .5rem;
    padding: 1rem;
}
</style>